import { useState } from 'react'

import './App.css'

function App() {
  const [count, setCount] = useState(0)

  return (
    <>

    </>
  )
}

export default App


// TASK-01
// створити роутінг для сайту команії "Калампуцало inc."

// список сторінок:

// Home - з кількома прямокутникам, що символізують секції, вгорі на сторінці мають
//  бути посиланя для переходу на всі інші сторінки. кожна інша сторінка має мати тільки посилання назад до сторінки Home
// About - текст про компанію, можна згенерувати за допомогою чату джіпіті
// Team - список співробітників. імена:
// Gog Die - CEO
// Gaga Doe - CMO
// Gugu Doo - CTO
// Gigi Dii - COO
// Gaga Dae - Head of Sales
// Contacts - контактна інформація:
// адреса: вул. Банальна, 404, м. Київ
// email: kalamputsalo-salo@gmail.com
// телефон: +380 44 404 44 44
// TASK-02
// створити роутінг для інтернет магазину фермерського обладнання.

// хедер та футер на кожній сторінці мають бути однаковими

// хедер - містить посиланя на всі сторінки, включно з головною. 
// для посилання на сторінку корзини використовувати піктограму корзини футер - 
// просто напис з копірайтом та поточним роком

// Home - "/" - з кількома прямокутникам, що символізують секції лендінгу
// Catalog - "/catalog" - список товарів. кожен товар має мати назву, ціну та кнопку "купити"
// Product - "/catalog/:id" - сторінка товару. має містити фото товару, назву, ціну,
//  опис та кнопку "купити"
// Cart - "/cart" - список товарів які користувач вибрав для покупки. кожен товар має 
// мати кнопку "видалити"
// список товарів можна зберігати в json файлі в теці public. дані з нього отримувати
//  за допомогою fetch всередині хуку useEffect

// TASK-03
// Створити систему ротінгу з можливістю змінювати роль.

// ролі:

// admin
// user
// guest
// на головній сторінці - кнопки з назвами ролей. по кліку на кожну з ролей - 
// зʼявляється список посилань зі сторінками які доступні тільки цій ролі.

// список сторінок для ролі admin:

// Home - "/"
// Products - "/products"
// Users - "/users"
// Sessions - "/sessions"
// список сторінок для ролі user:

// Home - "/"
// Products - "/products"
// Product - "/products/:id"
// список сторінок для ролі guest: