import Accordion from "./components/Accordion";
export interface FagItem {
  q: string;
  a: string
}

const faqList: FagItem[] = [
  {
    q: "Як зробити замовлення?",
    a: "Щоб зробити замовлення, виберіть товари, додайте їх у кошик та натисніть 'Оформити замовлення'."
  },
  {
    q: "Які способи оплати доступні?",
    a: "Ви можете оплатити замовлення банківською картою або через електронні гаманці."
  },
  {
    q: "Чи є можливість повернення товару?",
    a: "Так, ви можете повернути товар протягом 14 днів з моменту отримання, якщо він не був використаний."
  },
  {
    q: "Скільки часу займає доставка?",
    a: "Доставка зазвичай займає від 2 до 5 робочих днів залежно від вашого місцезнаходження."
  },
  {
    q: "Як зв'язатися зі службою підтримки?",
    a: "Ви можете зв'язатися з нами через електронну пошту або за номером телефону, вказаними на сайті."
  }
];

const App = () => {
  return (
    <>
      <Accordion faqList={faqList} />
    </>
  )
}

export default App;