import Quizz from './components/QUIZZ/Quizz';
import './App.css';

const quizzQuestions: string[] = [
  "Що таке React і які проблеми він призначений вирішувати?",
  "Яка різниця між React та іншими JavaScript-фреймворками, наприклад, Angular або Vue.js?",
  "Які є основні концепції React?",
  "Що таке JSX і чому його використовують у React?",
  "Як створити компонент у React?",
  "Яка різниця між функціональними та класовими компонентами?",
  "Як передати дані в компонент у React?",
  "Як створити події (events) у React?",
  "Як працює внутрішній стан (state) компонента?",
  "Що таке життєвий цикл компонента і які методи він має?",
  "Як виконати умовний рендеринг у React?",
  "Як відображати списки у React?",
  "Як виконати обробку форм у React?",
  "Як використовувати стилі у React компонентах?",
  "Що таке пропси (props) у React?",
  "Як передавати пропси між компонентами?",
  "Як стилізувати компоненти у React з використанням CSS модулів?",
  "Як використовувати умовні оператори у JSX?",
  "Як відображати у React картинки або інші медіа-елементи?",
  "Як використовувати рефи (refs) у React?"
];

function App() {
  return (
    <>
      <Quizz props={quizzQuestions} />
    </>
  );
}
export default App


// Загальне ДЗ
// написати компонент Quizz, який має наступні props-и:

// questions - масив рядків з питаннями
// Функціонал:

// першою на екрані зʼявляться кнопка "start quizz"
// по кліку на неї - зʼявляється перше питання зі списку, а текст кнопки змінюється на "next"
// по кліку на "next" - зʼявляється наступне питання
// коли питання закінчаться - замість кнопки "next" зʼявляється кнопка "finish"
// по кліку на "finish" - зʼявляється текст "quizz is finished"